# Базовый образ, который тоже состоит из слоев
FROM python:3.10-slim

# Новый слой - это директория внутри контейнера, все что пишем будет там, это можно будет увидеть только зайдя вовнутрь контейнера
WORKDIR /flask-app
# Новый слой
COPY requirements.txt .
# Новый слой
RUN pip install -r requirements.txt
# копировать все файлы из этой папки в папку контейнера
COPY . .
# Новый слой
# Новый слой
CMD ["gunicorn", "run:app", "-b", "0.0.0.0:25000", "-w", "4"]

#CMD ["gunicorn", "run:app", "-b", "0.0.0.0:25000", "-w", "4"]